{"name": "Designs", "artifacts": [{"id": "DD-11", "body": "Client registers for flight route events A client shall register with the _UIMiddleware_ to receive flight route event notifications whenever a flight route is created modified or deleted.", "type": "Designs"}, {"id": "DD-19", "body": "Client registers for UAV configuration event A client shall register with the _UIMiddleware_ to receive notifications whenever a new UAV type configuration is created modified or deleted.", "type": "Designs"}, {"id": "DD-21", "body": "Client registers for UAV activation events A client shall register with the _UIMiddleware_ to receive notifications whenever UAV instances are activated or deactivated.", "type": "Designs"}, {"id": "DD-23", "body": "Coordinate Specification All waypoints shall be specified using degrees longitude and latitude using Decimal Degrees format (e.g. 38.6556758 -77.7872153)", "type": "Designs"}, {"id": "DD-26", "body": "Activation state is ON_GROUND When a UAV is initially activated on the ground it is in the {{ON_GROUND}} state", "type": "Designs"}, {"id": "DD-30", "body": "Transition from ON_GROUND to AWAITING_TAKEOFF_CLEARANCE When a flight plan is assigned to a UAV in the {{ON_GROUND}} state it transitions to the {{AWAITING_TAKEOFF_CLEARANCE}} state.", "type": "Designs"}, {"id": "DD-32", "body": "Transition from TAKING_OFF to FLYING When a UAV in the TAKING_OFF state achieves the target altitude it transitions to FLYING state.", "type": "Designs"}, {"id": "DD-75", "body": "Upload externally created flight route Flight routes shall be created externally and uploaded to Dronology via the UI middleware.", "type": "Designs"}, {"id": "DD-84", "body": "Default sequencing of UAV's flight plans By default the pending flight plansof a UAV's shall be serviced in FCFS order.", "type": "Designs"}, {"id": "DD-87", "body": "Remove flight plan from queue A flight plan shall be unassigned from a UAV by removing it from the UAV's flight plan queue.", "type": "Designs"}, {"id": "DD-113", "body": "Display state of activated UAVs The name state battery level speed and current coordinates of each UAV shall be displayed.", "type": "Designs"}, {"id": "DD-118", "body": "Load saved map scale When loading the map it shall be scaled as specified in the configuration.", "type": "Designs"}, {"id": "DD-121", "body": "Update UAV location frequency The UAV location shall be updated on the map at the currently defined {{UI_UAV_REFRESH_RATE}}", "type": "Designs"}, {"id": "DD-168", "body": "Display a list of existing routes Upon loading the UI requests all existing routes from the _UIMiddleware_. Once the _UIMiddleware_ respond to the request the UI displays all existing routes", "type": "Designs"}, {"id": "DD-213", "body": "Log all GCS related events All commands sent to and messages received from a _CGC_ shall be logged to a dedicated GCS log file", "type": "Designs"}, {"id": "DD-352", "body": "Transmit new route assignments to UI Middleware When routes are assigned to a UAV a request shall be sent to the _UIMiddleware_ to update the assignment in Dronology.", "type": "Designs"}, {"id": "DD-361", "body": "GCS connection to GCS Middleware In step one the _GCS_ announces itself to the _GCSMiddleware_ providing its unique ID.", "type": "Designs"}, {"id": "DD-421", "body": "Change color for the first and the last waypoint Waypoints in a flight route shall be colored so as to differentiate between the starting waypoint ending waypoint and all remaining intermediate waypoints.", "type": "Designs"}, {"id": "DD-445", "body": "Monitoring API The _DronologyRuntimeMonitor_ shall allow to publish arbitrary monitoring messages and subscribe to certain message types", "type": "Designs"}, {"id": "DD-498", "body": "Mission Planning supports synchronized waits When a UAV is executing flight plans and reaches a synchronization point which is followed by a delay task it shall wait to proceed until the delay specified in seconds is expired", "type": "Designs"}, {"id": "DD-502", "body": "Specify flight route in standard format Flight routes shall be specified in the standard XML_FlightRoute format.", "type": "Designs"}, {"id": "DD-506", "body": "Save flight route When a flight route is uploaded to Dronology the _FlightRouteManager_ shall save it under a unique name as an xml file.", "type": "Designs"}, {"id": "DD-509", "body": "Takeoff Altitude Tag The flight route xml format includes an optional takeoff altitude tag", "type": "Designs"}, {"id": "DD-512", "body": "Coordinate system conversion to n-vector When requested the _CoordinateSystem_ shall transform coordinates transformed from the default representation to n-vectors.", "type": "Designs"}, {"id": "DD-514", "body": "Coordinate system conversion from n-vector When requested coordinates shall be transformed from n-vectors to the default representation.", "type": "Designs"}, {"id": "DD-518", "body": "Location accuracy Distances computed between two coordinates shall be accurate within 1 meter over a distance of 400 000 meters.", "type": "Designs"}, {"id": "DD-520", "body": "Return To Home as single waypoint When the UAV is commanded to return to home the current flight plan shall be removed and a new flight plan shall be created containing only a single waypoint representing its original launch coordinates.", "type": "Designs"}, {"id": "DD-524", "body": "No waypoint directives during Hover In Place If the UAV is in 'hover in place' mode then no waypoints directives for that UAV shall be sent to the _GCS_.", "type": "Designs"}, {"id": "DD-527", "body": "Send first waypoint at start of flight plan At the start of a flight plan the system shall send the first target waypoint to the UAV's _GCS_.", "type": "Designs"}, {"id": "DD-529", "body": "Determine if waypoint is reached If the computed distance from the UAV to the target waypoint is less than {{THRESHOLD_WAYPOINT_DISTANCE}} than the waypoint shall be considered reached.", "type": "Designs"}, {"id": "DD-532", "body": "Check flight plan for takeoff altitude When the takeoff command is issued the _FlightSchedulingAndExecution _checks for a pre-specified altitude in the flight plan.", "type": "Designs"}, {"id": "DD-534", "body": "Use default altitude if not provided in flight plan If no takeoff altitude is prescribed in the flight plan assigned to a UAV currently on the ground then the system-wide default altitude is used as the target takeoff altitude.", "type": "Designs"}, {"id": "DD-536", "body": "Ordered lists of routes in Mission Plan Each individual UAV that is included in a MissionPlan shall have an ordered list of one or more flight routes assigned to it.", "type": "Designs"}, {"id": "DD-538", "body": "Wait at synchronization points When a UAV is executing flight plans and reaches a synchronization point it shall wait to proceed until all other UAVs sharing the same synchronization point have also reached this point.", "type": "Designs"}, {"id": "DD-542", "body": "Mission Planning When a predefined FlightPattern is included in a MissionPlan it shall be expanded prior to use into a set of waypoints and synchronization points for each of the participating UAVs.", "type": "Designs"}, {"id": "DD-544", "body": "Synchronized Landing The FlightPattern for synchronized landing shall direct each UAV to synchronize at the final waypoint of the preceding route ascend or descend to a unique altitude synchronize fly to the longitude and latitude of the home coordinates synchronize and then descend to the landing altitude.", "type": "Designs"}, {"id": "DD-548", "body": "Flight Plan scheduling When a flight route is scheduled for execution its waypoints takeoff altitude and identifier shall be used to instantiate a new flight plan", "type": "Designs"}, {"id": "DD-552", "body": "Automatic Flight Plan Assignment If a flight plan is not assigned to a specific UAV the flight plan scheduler shall automatically assign it to the next available UAV.", "type": "Designs"}, {"id": "DD-554", "body": "Assign next flight plan at completion of flight If the flight plan queue is not empty when the UAV reaches the final waypoint of its current flight plan then the next flight plan is removed from the queue and set as the currently executed flight plan.", "type": "Designs"}, {"id": "DD-557", "body": "Only one executing flight plan per UAV Each UAV can only store one currently executing flight plan ID.", "type": "Designs"}, {"id": "DD-560", "body": "No reassignment of aborted flight plan An aborted flight plan shall not be reassigned to any UAV", "type": "Designs"}, {"id": "DD-564", "body": "Continue to original destination When a UAV which has been receiving evasive directives is no longer in close proximity to an object the _ObjectAvoidance_ system shall stop sending directives and the UAV will continue towards its destination.", "type": "Designs"}, {"id": "DD-566", "body": "Onboard obstacle avoidance The _ObjectAvoidance_ system shall retrieve the state of the UAVs onboard ObjectAvoidance status.", "type": "Designs"}, {"id": "DD-568", "body": "UAV Distance The ObjectAvoidance system shall compute pair-wise distances between UAVs", "type": "Designs"}, {"id": "DD-571", "body": "UAV type specification assignment Each Virtual and Physical drone is associated with a predefined {{UAV_TYPE}} defining its basic attributes.", "type": "Designs"}, {"id": "DD-573", "body": "Simulated UAVs assigned unique IDs An internally simulated UAV is instantiated with an ID that is unique from the IDs of all other currently activated UAVs.", "type": "Designs"}, {"id": "DD-577", "body": "Support for internally simulated UAVs The system shall support internally simulated UAVs", "type": "Designs"}, {"id": "DD-579", "body": "Transition from IN_AIR to LANDING When a UAV is in {{IN_AIR}} state and receives a command to land it transitions to {{LANDING}} state", "type": "Designs"}, {"id": "DD-583", "body": "Reject duplicate request for UAV activation If the presented {{UAV_ID}} represents a currently activated UAV then the _GCS_Middleware_ will be notified and no additional activation will be performed.", "type": "Designs"}, {"id": "DD-585", "body": "Reject non registered UAV If the presented {{UAV_ID}} does not represent a currently registered UAV then the _UAVActivationManager_ will reject the activation and notify the _GCS_Middleware_", "type": "Designs"}, {"id": "DD-588", "body": "Deactivates Physical UAVs When a UAV is deactivated all scheduled flight plans shall be removed from the UAV's flightplan pool.", "type": "Designs"}, {"id": "DD-599", "body": "Simulate takeoff in internal simulator When given a takeoff command the _InternalSimulator_ shall move with infinite acceleration the UAV to the takeoff altitude corresponding to its current longitude and latitude.", "type": "Designs"}, {"id": "DD-601", "body": "Simulate travel to target While responding to a goto command the _InternalSimulator_ shall continue moving in steps towards the target coordinates until the target has been reached.", "type": "Designs"}, {"id": "DD-603", "body": "Simulate battery drain in simple simulator When a simulated UAV is in flight the _InternalSimulator_ shall reduce the battery every second by {{SIMULATOR_BATTERY_DRAIN_VOLTS}}.", "type": "Designs"}, {"id": "DD-606", "body": "Simulate goto in NVECSimulator When given a goto command the _NVECSimulator_ shall compute the next coordinate based upon the normal vector and altitude of the current position and the normal vector and altitude of the destination. The simulator shall move the UAV with infinite acceleration and use numerical methods to hone in on the next coordinate which will be {{SIMULATION_STEP_SIZE}} meters from the current position along the travel path.", "type": "Designs"}, {"id": "DD-608", "body": "Simulate land in NVECSimulator When given a land command the _NVECSimulator_ shall immediately change the UAV's current altitude to the ground altitude.", "type": "Designs"}, {"id": "DD-612", "body": "Create log event upon initiation of flight plan When a flight plan is initiated a log event shall be created that includes the name of the route the UAV it is assigned to and the initiation time stamp.", "type": "Designs"}, {"id": "DD-614", "body": "Create log event when UAV reaches a waypoint When a UAV reaches a waypoint while executing a flight plan a log event shall be created that includes the coordinates of the waypoint the UAV the flight plan is assigned to the flight plan ID and the timestamp.", "type": "Designs"}, {"id": "DD-617", "body": "Log all commands sent to GCS Each command sent to a _GCS_ via the _GCS_Middleware_ shall be logged", "type": "Designs"}, {"id": "DD-619", "body": "Log state and monitoring messages While the log level {{HW_TRACE}} is active each state and monitoring message shall be logged.", "type": "Designs"}, {"id": "DD-622", "body": "UI middleware handles control lock requests The _UIMiddleware_ shall forward control requests from UI clients to hold a control lock on a UAV.", "type": "Designs"}, {"id": "DD-624", "body": "UI middleware handles control heartbeat The _UIMiddleware_ shall monitor liveness of clients holding control locks on individual UAVs.", "type": "Designs"}, {"id": "DD-627", "body": "UI middleware lists currently active UAVs The _UIMiddleware_ returns a list of UAV proxy objects containing information about all active UAVs including location battery level ground speed and health status.", "type": "Designs"}, {"id": "DD-631", "body": "UI middleware forwards hover in place commands from clients to dronology The _UIMiddleware_ accepts hover in place commands associated with a unique {{UAV_ID}} and forwards to Dronology", "type": "Designs"}, {"id": "DD-633", "body": "UI middleware forwards return to home commands from clients to dronology The _UIMiddleware_ accepts return to home commands associated with a unique UAV ID and forwards to Dronology", "type": "Designs"}, {"id": "DD-636", "body": "UI middleware supports flight route modification When requested by a UI client the _UIMiddleware_ shall support the modification of an existing flight route with an given ID.", "type": "Designs"}, {"id": "DD-640", "body": "UI forwards mission plan requests to dronology The _UIMiddleware_ shall forward a mission plan request to dronology.", "type": "Designs"}, {"id": "DD-647", "body": "Assign routes to UAV The user shall select a UAV and then assign routes to it from an available route list.", "type": "Designs"}, {"id": "DD-650", "body": "Transmit Route removals to UI Middleware When route assignments are removed from a UAV a request shall be sent to the _UIMiddleware_ to remove the assignment in Dronology.", "type": "Designs"}, {"id": "DD-654", "body": "UI requests pending flight plans from UI Middleware When the user requests to view flight plans assigned to a UAV the UI requests the pending flight plans from the UAV_FlightInfo object and displays them.", "type": "Designs"}, {"id": "DD-658", "body": "Delete routes Flight plans assigned to an UAV that have not yet been executed may be deleted by selecting the route and clicking the deselect button.", "type": "Designs"}, {"id": "DD-661", "body": "Request UI_Middleware to cancel pending flight When the user presses the cancel pending flight plan button a request is sent to the _UI_Middleware_ to cancel the flight.", "type": "Designs"}, {"id": "DD-667", "body": "Validate route altitude and speed The altitude and speed values shall not exceed the current maximum {{UAV_MAX_ALTITUDE}}. {{UAV_MAX_GROUND_SPEED}} set in the system.", "type": "Designs"}, {"id": "DD-671", "body": "Persist Route The route information shall be represented using the Standard Route XML format and transmitted to the _UIMiddleware_", "type": "Designs"}, {"id": "DD-674", "body": "Create and modify route in visual mode \"The _RouteCreationUI_ shall support route creation and modification in visual mode allowing the user to click on a location in order to create modify or delete a waypoint. \"", "type": "Designs"}, {"id": "DD-676", "body": "View multiple routes When selected by the user multiple routes shall be displayed simultaneously on the map.", "type": "Designs"}, {"id": "DD-682", "body": "Request UAV state upon loading Upon loading the UI shall request information about all activated UAVs from the _UIMiddleware_ . Once the _UIMiddleware_ respond to the request the UI shall display a list of all currently activated UAVs.", "type": "Designs"}, {"id": "DD-684", "body": "Display map in UI When the _RealTimeFlightUI_ is loaded a map shall be displayed with the default zoom level and center coordinates specified in a configuration file.", "type": "Designs"}, {"id": "DD-686", "body": "Differentiate UAV types Different types of UAVs shall have different icons.", "type": "Designs"}, {"id": "DD-688", "body": "Periodically update UAV location The UI shall periodically request current locations of all registered UAVs from the _UIMiddleware_ and update their locations on the map.", "type": "Designs"}, {"id": "DD-692", "body": "UAV Operations Operations shall include RTL takeoff hover-in-place and resend command.", "type": "Designs"}, {"id": "DD-696", "body": "Initiating the follow mode \"When \"\"UI follow mode\"\" is initiated the map shall automatically zoom and pan so that all selected UAVs are centered and their active routes constitutes 60% of the view.\"", "type": "Designs"}, {"id": "DD-699", "body": "Emergency Battery Notification When the UAV's battery level drops below a predefined threshold then the UAV health indicator is activated.", "type": "Designs"}, {"id": "DD-704", "body": "Hierarchical organization of monitoring topics Topics shall be organized in a hierarchical manner meaning that clients can subscribe to all messages messages from certain GCS UAVS and properties", "type": "Designs"}, {"id": "DD-707", "body": "Publishing of Monitoring Message A monitoring message shall contain a (hierarchical) identifier describing the topic a message type a timestamp and arbitrary serializeable data attached to the message", "type": "Designs"}, {"id": "DD-711", "body": "Establish conneciton with GCT middleware The _GCSMiddleware_ shall accept connections with multiple _GCS_", "type": "Designs"}, {"id": "DD-713", "body": "Unique ID for each GCS Each _GCS_ connecting to the _GCSMiddleware_ shall be identified through a unique {{GROUNDSTATION_ID}}.", "type": "Designs"}, {"id": "DD-716", "body": "GCS UAV announcement In step three the _GCS_ announces its current set of recognized UAVs to the _GCSMiddleware_.", "type": "Designs"}, {"id": "DD-719", "body": "Activation request results The _GCS_ shall be informed of the result of the activation request.", "type": "Designs"}, {"id": "DD-721", "body": "Activation request denied When the activation request is denied the _GCSMiddleware_ shall send a predefined activation denied message to the _GCS_.", "type": "Designs"}, {"id": "DD-724", "body": "UAV State Messages UAV State messages shall be formatted as JSON objects and contain both mandatory and optional elements.", "type": "Designs"}, {"id": "DD-728", "body": "UAV Set State Message Frequency Command The _GCSMiddleware_ shall be able to handle and send a setStateFrequency command to the respective _GCS_ containing the desired Frequency in ms.", "type": "Designs"}, {"id": "DD-731", "body": "UAV Movement Command Types Each movement command shall specify one of the following command types: {{GOTO_WAYPOINT SET_GROUNDSPEED SET_VELOCITY TAKEOFF LAND HOVER}}", "type": "Designs"}, {"id": "DD-733", "body": "UAV SetGroundspeed Command The {{SET_GROUNDSPEED}} command shall specify ground speed in meters per second.", "type": "Designs"}, {"id": "DD-735", "body": "UAV Takeoff Command The {{TAKEOFF}} command shall specify the target altitude", "type": "Designs"}, {"id": "DD-740", "body": "Forward commands to UAV The _GCS_ shall transform commands into a vehicle specific format.", "type": "Designs"}, {"id": "DD-743", "body": "Default message frequency The default message frequency for UAV state messages shall be {{UAV_MESSAGE_STATE_FREQUENCY}}", "type": "Designs"}, {"id": "DD-745", "body": "Adjust message frequency upon command When the _GCS_ receives a set frequency command from the _GCSMiddleware_ it shall adjust its messange frequency accordingly.", "type": "Designs"}, {"id": "DD-748", "body": "Close connection if incorrect UAV registration If the _GCS_ receives notification that the UAV is inc", "type": "Designs"}]}
